; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image1 - mode
	spectrograph0 - mode
	Star3 - direction
	Star2 - direction
	Star4 - direction
	Star0 - direction
	Star1 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star4)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
)
(:goal (and
	(pointing satellite0 Planet13)
	(pointing satellite1 Phenomenon8)
	(have_image Star5 image1)
	(have_image Planet6 image1)
	(have_image Planet7 spectrograph0)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon9 spectrograph0)
	(have_image Star10 image1)
	(have_image Planet11 image1)
	(have_image Star12 image1)
	(have_image Planet13 spectrograph0)
))

)

; plan
1. (turn_to satellite1 phenomenon8 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 11
2. (turn_to satellite0 star4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star4)
   goals met: 1 of 11
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 11
4. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 1 of 11
5. (turn_to satellite0 planet11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet11)
   goals met: 1 of 11
6. (take_image satellite0 planet11 instrument1 image1)
   added: (have_image planet11 image1)
   goals met: 2 of 11
7. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 11
8. (take_image satellite0 phenomenon9 instrument1 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 3 of 11
9. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 4 of 11
11. (turn_to satellite0 planet6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet6)
   goals met: 4 of 11
12. (take_image satellite0 planet6 instrument1 image1)
   added: (have_image planet6 image1)
   goals met: 5 of 11
13. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 5 of 11
14. (take_image satellite0 planet7 instrument1 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 6 of 11
15. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 6 of 11
16. (take_image satellite0 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 7 of 11
17. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 7 of 11
18. (take_image satellite0 star12 instrument1 image1)
   added: (have_image star12 image1)
   goals met: 8 of 11
19. (turn_to satellite0 star5 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star5)
   goals met: 8 of 11
20. (take_image satellite0 star5 instrument1 image1)
   added: (have_image star5 image1)
   goals met: 9 of 11
21. (turn_to satellite0 planet13 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet13)
   goals met: 10 of 11
22. (take_image satellite0 planet13 instrument1 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 11 of 11
